<?php

return [
	/*
	|--------------------------------------------------------------------------
	| 000 (Init,Home) 初始化/默认
	|--------------------------------------------------------------------------
	*/
	// 00 default/common
	'request_success'      => '0000000|请求成功!',
	'request_error'        => '0000001|请求失败!',
	'access_token_empty'   => '0000002|请求 Token 值不存在!',
	'access_token_expired' => '0000003|请求 Token 值已经过期!',

	// 01 init
	'init_success'         => '0000100|初始化成功!',
	'init_time_offset_max' => '0000101|服务器时差和客户端时差差别过大!',
	'init_device_unvalid'  => '0000102|不允许的客户端类型!',
	'init_version_unvalid' => '0000103|不允许的Api版本!',
	'init_sign_error'      => '0000104|验签码错误!',
	'init_time_unvalid'    => '0000105|时间格式不正确!',


	/*
	|--------------------------------------------------------------------------
	|  001 (Account) 账户
	|--------------------------------------------------------------------------
	*/
	// 00 login
	'login_success'        => '0010000|登陆成功!',
	'login_not_in'         => '0010001|您尚未登录, 请登陆后再行访问!',
	'login_already'        => '0010002|您已登录!',
	'login_info_error'     => '0010003|登录失败, 不正确的用户名或密码!',

	// 01 logout
	'logout_success'       => '0010100|您已退出登录!',

	// 02 info
	'info_get_success'     => '0010200|获取用户信息成功!',

	/*
	|--------------------------------------------------------------------------
	|  002 (Order) 订单
	|--------------------------------------------------------------------------
	*/
	'order_my_success'     => '0020100|获取我的订单成功!',
	'order_my_empty'       => '0020101|订单列表为空!',

];














