<?php
return [

	/*
	|--------------------------------------------------------------------------
	| 存储的磁盘
	|--------------------------------------------------------------------------
	| 定义在 filesystem.php 中 disks 部分, 默认是 public
	*/
	'server_disk'      => env('UPLOAD_SERVER_DISK', 'public_upload'),


	/*
	|--------------------------------------------------------------------------
	| 服务器令牌失效时间 (分钟)
	|--------------------------------------------------------------------------
	*/
	'expires'          => 3600,

	/*
	|--------------------------------------------------------------------------
	| 上传类型, 默认是 lemon: 存储到
	|--------------------------------------------------------------------------
	*/
	'type'             => env('UPLOAD_TYPE', 'lemon'),

	/*
	|--------------------------------------------------------------------------
	| 替换URL地址
	|--------------------------------------------------------------------------
	*/
	'replace_url'      => [
		'http://www.larxd.com/uploads/',
		'http://img1.ixdcw.com/',
		'http://img2.ixdcw.com/thumber/config/',
		'http://img1.ixdcw.net/',
		'http://img.ixdcw.net/xundu/default/',
		'http://img.ixdcw.com/xundu/default/',
		'http://img.mirror1.larxd.com/',
		'http://img1.www.ixdcw.net/',
		'http://www.lar_xd.com',
	],

	/*
	|--------------------------------------------------------------------------
	| 七牛的配置文件
	|--------------------------------------------------------------------------
	*/
	'qiniu_access_key' => env('QINIU_ACCESS_KEY'),
	'qiniu_secret_key' => env('QINIU_SECRET_KEY'),
	'qiniu_bucket'     => env('QINIU_BUCKET'),
	'qiniu_url'        => env('QINIU_URL'),
];